20210912124846-dotfiles.org
:PROPERTIES:
:ID:       32295609-a416-4227-9aa9-47aefc42eefc
:END:
#+title: dotfiles
* 概要
Linux系のプログラムでは、dotfileと呼ばれる ~.~ から始まるプレーンテキストで設定を書くことが多い。

- [[id:90c6b715-9324-46ce-a354-63d09403b066][Git]]管理できる
- 別のマシンでも全く同じ環境を作り出すことができる

などのメリットがある。

[[https://github.com/kijimaD/dotfiles][kijimaD/dotfiles: System settings]]
* Memo
** QEMU(仮想デスクトップ環境)
新しい[[id:7a81eb7c-8e2b-400a-b01a-8fa597ea527a][Linux]]ディストリビューションを試すときや、設定を変更するときは仮想マシン上で行ったほうがいい。
気軽に試せるし、再現性が高い。緊密なフィードバックループがあるとき開発は効率的になる。

逆にマシン本体へのインストールだと、設定変更や壊れたときの対応が面倒。
マシン本体へのインストールは本番環境みたいなもので、すばやく試すのには向いてないし、壊れたときがさらに面倒。
** [[id:d694ecaa-6a8b-4669-a95c-f76de6dcbd2c][GNU Guix]]を仮想マシンで起動する
[[id:d694ecaa-6a8b-4669-a95c-f76de6dcbd2c][GNU Guix ]][[https://www.youtube.com/watch?v=7ZdMRLPZhFs][5 Reasons to Try Guix in 2022 - YouTube]]
#+begin_src shell
  sudo apt install qemu-kvm
  qemu-system-x86_64 \
      -nic user,model=virtio-net-pci \
      -enable-kvm -m 2048 \
      -device virtio-blk,drive=guix-demo \
      -drive if=none,file=$HOME/Downloads/guix-vm.qcow2,id=guix-demo \
#+end_src
** Windowsを仮想マシンで起動する
[[https://qiita.com/Hiroki_Kawakami/items/b18f6c50df4ce215e40d][無料のWindows仮想マシンをQEMUで動かす - Qiita]]

#+caption: Hyper-V用のイメージWin10.vhdxを用意して起動する
#+begin_src shell
qemu-system-x86_64 -m 4096 -smp 2 -hda MSEdge\ -\ Win10.vhdx -enable-kvm
#+end_src

[[https://developer.microsoft.com/en-us/microsoft-edge/tools/vms/][配布サイト]]に記載のように、パスワードは ~Passw0rd!~ 。
仮想マシンのフォーカスを抜けるにはCtrl + Alt + g。
* 好みのOSを作る
カスタマイズ性の高いソフトを組み合わせて、再現性の高い最高のシステムを作る。
Guixは土台になる。
だいたい[[id:fa497359-ae3f-494a-b24a-9822eefe67ad][System Crafters]]の情報がベースになってる。

- プレーンテキストでの設定
- 柔軟な設定
- コードがオープン
- キーボード指向

** [[id:d694ecaa-6a8b-4669-a95c-f76de6dcbd2c][GNU Guix]]
パッケージ管理システム。
** GNU [[id:1ad8c3d5-97ba-4905-be11-e6f2626127ad][Emacs]]
環境。
** GNU Stow
設定ファイル管理ツール。
シンボリックリンクを管理してくれる。
** GNU Shepherd
サービス管理ツール。
** GNU Make
古代からのビルド用ツール。タスク定義をドキュメント化するのに使う。
** nyxt
完全キーボードでのインターネットブラウジングを可能にする。
** i3-wm
どうしてもEmacsで日本語入力ができない。
ibusが特定アプリで動作しない不具合にあたっている。
gnomeでは完全にできるので、自動でやってくれてるところがあるよう。
Emacs上ではskkを使うようにして解決。Emacs以外では普通に入力すればいい。

ドキュメント
https://i3wm.org/docs/userguide.html#_hiding_vertical_borders

- close window: ~Mod + Shift + q~
** polybar
柔軟に設定できるメニューバー。
** compton
Emacs側で透過設定しても字が薄くなって微妙だが、ウィンドウ側でやると綺麗にできる。
また、ほかのアプリケーションを透過できて統一感がある。かっこいい。
** feh
背景を設定する。
#+begin_src shell
  feh --bg-fill -Zr ~/dotfiles/backgrounds/4k-Ultra-HD_00330.jpg
#+end_src
** dunst
[[https://github.com/dunst-project/dunst][dunst-project/dunst: Lightweight and customizable notification daemon]]
通知機能が入ってないウィンドウシステムでは([[id:eb196529-bdbd-48c5-9d5b-a156fe5c2f41][EXWM]]とか)、これを組み合わせて通知する。
* Tasks
** TODO インストールタスクが壊れてるのを直す
:LOGBOOK:
CLOCK: [2023-09-18 Mon 18:43]--[2023-09-18 Mon 19:08] =>  0:25
CLOCK: [2023-09-18 Mon 18:12]--[2023-09-18 Mon 18:37] =>  0:25
:END:

イメージからインストールする前提でMakeタスクのいくつかを消しているので、手動でインストールするときは大変面倒なことになっている。直す。

#+caption: org-roamを使うときに必要だった
#+begin_src shell
sudo apt install libsqlite3-dev
#+end_src

** TODO DBeaverインストール
閲覧に便利なdbクライアントをインストールする。
** TODO strategyを設定する
ubuntu22.04, ubuntu20.04, xubuntuを同時にテストできるようにしたい。できないにしても、動作確認には役立つ…か。少なくともデグレは防げる。
** TODO イメージを22.04に上げる
:LOGBOOK:
CLOCK: [2022-09-17 Sat 17:04]--[2022-09-17 Sat 17:29] =>  0:25
CLOCK: [2022-09-14 Wed 14:52]--[2022-09-14 Wed 15:17] =>  0:25
:END:
今は20.04。
** TODO dist-upgradeする
22.04をイメージのベースにするのが厳しそうなので、妥協してdist-upgradeを走らせる。

どうしてもアップデートの途中で止まってしまう。
** TODO makeタスクを整理
:LOGBOOK:
CLOCK: [2022-09-19 Mon 07:47]--[2022-09-19 Mon 08:12] =>  0:25
CLOCK: [2022-09-18 Sun 17:07]--[2022-09-18 Sun 17:32] =>  0:25
:END:
ブートイメージ化で不要になったものがあったり、逆に必要なものがあったりする。
** TODO イメージ展開用のmakeタスクを作成
動作検証で頻繁にやるので。
* Reference
** [[https://config.daviwil.com/desktop][Desktop Environment - config.daviwil.com]]
すごいdotfile。
** [[https://gitlab.com/dnsmichi/dotfiles][Michael Friedrich / dotfiles · GitLab]]
dotfilesの例。
** [[https://sachachua.com/dotemacs/][Sacha Chua's Emacs configuration]](Sacha Chua)
Emacsで有名な人のdotfiles。設定が莫大。
** [[https://sqrtminusone.xyz/configs/readme/][My dotfiles]](SqrtMinusOne)
Emacs界隈でよく見かける人。グラフ化していて良い。
** [[https://mvallim.github.io/live-custom-ubuntu-from-scratch/][How to create a custom Ubuntu live from scratch | live-custom-ubuntu-from-scratch]]
スクラッチでブータブルイメージを作る。
* Archives
