20210912124846-dotfiles.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-11-01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>dotfiles</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">dotfiles</h1>
<div id="outline-container-orge00d862" class="outline-2">
<h2 id="orge00d862"><a href="#orge00d862">概要</a></h2>
<div class="outline-text-2" id="text-orge00d862">
<p>
Linux系のプログラムでは、dotfileと呼ばれる <code>.</code> から始まるプレーンテキストで設定を書くことが多い。
</p>

<ul class="org-ul">
<li><a href="20210901104129-git.html#ID-90c6b715-9324-46ce-a354-63d09403b066">Git</a>管理できる</li>
<li>別のマシンでも全く同じ環境を作り出すことができる</li>
</ul>

<p>
などのメリットがある。
</p>

<p>
<a href="https://github.com/kijimaD/dotfiles">kijimaD/dotfiles: System settings</a>
</p>
</div>
</div>
<div id="outline-container-org3031813" class="outline-2">
<h2 id="org3031813"><a href="#org3031813">Memo</a></h2>
<div class="outline-text-2" id="text-org3031813">
</div>
<div id="outline-container-org82fbafc" class="outline-3">
<h3 id="org82fbafc"><a href="#org82fbafc">QEMU(仮想デスクトップ環境)</a></h3>
<div class="outline-text-3" id="text-org82fbafc">
<p>
新しい<a href="20220108110637-linux.html#ID-7a81eb7c-8e2b-400a-b01a-8fa597ea527a">Linux</a>ディストリビューションを試すときや、設定を変更するときは仮想マシン上で行ったほうがいい。
気軽に試せるし、再現性が高い。緊密なフィードバックループがあるとき開発は効率的になる。
</p>

<p>
逆にマシン本体へのインストールだと、設定変更や壊れたときの対応が面倒。
マシン本体へのインストールは本番環境みたいなもので、すばやく試すのには向いてないし、壊れたときがさらに面倒。
</p>
</div>
</div>
<div id="outline-container-orge846488" class="outline-3">
<h3 id="orge846488"><a href="#orge846488"><a href="20210525005710-gnu_guix.html#ID-d694ecaa-6a8b-4669-a95c-f76de6dcbd2c">GNU Guix</a>を仮想マシンで起動する</a></h3>
<div class="outline-text-3" id="text-orge846488">
<p>
<a href="20210525005710-gnu_guix.html#ID-d694ecaa-6a8b-4669-a95c-f76de6dcbd2c">GNU Guix </a><a href="https://www.youtube.com/watch?v=7ZdMRLPZhFs">5 Reasons to Try Guix in 2022 - YouTube</a>
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt install qemu-kvm
qemu-system-x86_64 <span class="org-sh-escaped-newline">\</span>
    -nic user,<span class="org-variable-name">model</span>=virtio-net-pci <span class="org-sh-escaped-newline">\</span>
    -enable-kvm -m 2048 <span class="org-sh-escaped-newline">\</span>
    -device virtio-blk,<span class="org-variable-name">drive</span>=guix-demo <span class="org-sh-escaped-newline">\</span>
    -drive <span class="org-variable-name">if</span>=none,<span class="org-variable-name">file</span>=$<span class="org-variable-name">HOME</span>/Downloads/guix-vm.qcow2,<span class="org-variable-name">id</span>=guix-demo <span class="org-sh-escaped-newline">\</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5e22177" class="outline-3">
<h3 id="org5e22177"><a href="#org5e22177">Windowsを仮想マシンで起動する</a></h3>
<div class="outline-text-3" id="text-org5e22177">
<p>
<a href="https://qiita.com/Hiroki_Kawakami/items/b18f6c50df4ce215e40d">無料のWindows仮想マシンをQEMUで動かす - Qiita</a>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Hyper-V用のイメージWin10.vhdxを用意して起動する</label><pre class="src src-shell">qemu-system-x86_64 -m 4096 -smp 2 -hda MSEdge<span class="org-string">\ </span>-<span class="org-string">\ </span>Win10.vhdx -enable-kvm
</pre>
</div>

<p>
<a href="https://developer.microsoft.com/en-us/microsoft-edge/tools/vms/">配布サイト</a>に記載のように、パスワードは <code>Passw0rd!</code> 。
仮想マシンのフォーカスを抜けるにはCtrl + Alt + g。
</p>
</div>
</div>
</div>
<div id="outline-container-org07650c9" class="outline-2">
<h2 id="org07650c9"><a href="#org07650c9">好みのOSを作る</a></h2>
<div class="outline-text-2" id="text-org07650c9">
<p>
カスタマイズ性の高いソフトを組み合わせて、再現性の高い最高のシステムを作る。
Guixは土台になる。
だいたい<a href="20210915221421-systemcrafters.html#ID-fa497359-ae3f-494a-b24a-9822eefe67ad">System Crafters</a>の情報がベースになってる。
</p>

<ul class="org-ul">
<li>プレーンテキストでの設定</li>
<li>柔軟な設定</li>
<li>コードがオープン</li>
<li>キーボード指向</li>
</ul>
</div>

<div id="outline-container-org55d4bd7" class="outline-3">
<h3 id="org55d4bd7"><a href="#org55d4bd7"><a href="20210525005710-gnu_guix.html#ID-d694ecaa-6a8b-4669-a95c-f76de6dcbd2c">GNU Guix</a></a></h3>
<div class="outline-text-3" id="text-org55d4bd7">
<p>
パッケージ管理システム。
</p>
</div>
</div>
<div id="outline-container-orgede1748" class="outline-3">
<h3 id="orgede1748"><a href="#orgede1748">GNU <a href="20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a></a></h3>
<div class="outline-text-3" id="text-orgede1748">
<p>
環境。
</p>
</div>
</div>
<div id="outline-container-org7b7ffa9" class="outline-3">
<h3 id="org7b7ffa9"><a href="#org7b7ffa9">GNU Stow</a></h3>
<div class="outline-text-3" id="text-org7b7ffa9">
<p>
設定ファイル管理ツール。
シンボリックリンクを管理してくれる。
</p>
</div>
</div>
<div id="outline-container-org1ed2860" class="outline-3">
<h3 id="org1ed2860"><a href="#org1ed2860">GNU Shepherd</a></h3>
<div class="outline-text-3" id="text-org1ed2860">
<p>
サービス管理ツール。
</p>
</div>
</div>
<div id="outline-container-org42ae9df" class="outline-3">
<h3 id="org42ae9df"><a href="#org42ae9df">GNU Make</a></h3>
<div class="outline-text-3" id="text-org42ae9df">
<p>
古代からのビルド用ツール。タスク定義をドキュメント化するのに使う。
</p>
</div>
</div>
<div id="outline-container-org7756db5" class="outline-3">
<h3 id="org7756db5"><a href="#org7756db5">nyxt</a></h3>
<div class="outline-text-3" id="text-org7756db5">
<p>
完全キーボードでのインターネットブラウジングを可能にする。
</p>
</div>
</div>
<div id="outline-container-org1f86f53" class="outline-3">
<h3 id="org1f86f53"><a href="#org1f86f53">i3-wm</a></h3>
<div class="outline-text-3" id="text-org1f86f53">
<p>
どうしてもEmacsで日本語入力ができない。
ibusが特定アプリで動作しない不具合にあたっている。
gnomeでは完全にできるので、自動でやってくれてるところがあるよう。
Emacs上ではskkを使うようにして解決。Emacs以外では普通に入力すればいい。
</p>

<p>
ドキュメント
<a href="https://i3wm.org/docs/userguide.html#_hiding_vertical_borders">https://i3wm.org/docs/userguide.html#_hiding_vertical_borders</a>
</p>

<ul class="org-ul">
<li>close window: <code>Mod + Shift + q</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgd93824e" class="outline-3">
<h3 id="orgd93824e"><a href="#orgd93824e">polybar</a></h3>
<div class="outline-text-3" id="text-orgd93824e">
<p>
柔軟に設定できるメニューバー。
</p>
</div>
</div>
<div id="outline-container-orgeb49014" class="outline-3">
<h3 id="orgeb49014"><a href="#orgeb49014">compton</a></h3>
<div class="outline-text-3" id="text-orgeb49014">
<p>
Emacs側で透過設定しても字が薄くなって微妙だが、ウィンドウ側でやると綺麗にできる。
また、ほかのアプリケーションを透過できて統一感がある。かっこいい。
</p>
</div>
</div>
<div id="outline-container-orgc20432c" class="outline-3">
<h3 id="orgc20432c"><a href="#orgc20432c">feh</a></h3>
<div class="outline-text-3" id="text-orgc20432c">
<p>
背景を設定する。
</p>
<div class="org-src-container">
<pre class="src src-shell">feh --bg-fill -Zr ~/dotfiles/backgrounds/4k-Ultra-HD_00330.jpg
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b29dde" class="outline-3">
<h3 id="org1b29dde"><a href="#org1b29dde">dunst</a></h3>
<div class="outline-text-3" id="text-org1b29dde">
<p>
<a href="https://github.com/dunst-project/dunst">dunst-project/dunst: Lightweight and customizable notification daemon</a>
通知機能が入ってないウィンドウシステムでは(<a href="20210905140122-exwm.html#ID-eb196529-bdbd-48c5-9d5b-a156fe5c2f41">EXWM</a>とか)、これを組み合わせて通知する。
</p>
</div>
</div>
</div>
<div id="outline-container-org8cefb58" class="outline-2">
<h2 id="org8cefb58"><a href="#org8cefb58">Tasks</a></h2>
<div class="outline-text-2" id="text-org8cefb58">
</div>
<div id="outline-container-org12254d5" class="outline-3">
<h3 id="org12254d5"><a href="#org12254d5"><span class="todo TODO">TODO</span> インストールタスクが壊れてるのを直す</a></h3>
<div class="outline-text-3" id="text-org12254d5">
<p>
イメージからインストールする前提でMakeタスクのいくつかを消しているので、手動でインストールするときは大変面倒なことになっている。直す。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>org-roamを使うときに必要だった</label><pre class="src src-shell">sudo apt install libsqlite3-dev
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd40b437" class="outline-3">
<h3 id="orgd40b437"><a href="#orgd40b437"><span class="todo TODO">TODO</span> DBeaverインストール</a></h3>
<div class="outline-text-3" id="text-orgd40b437">
<p>
閲覧に便利なdbクライアントをインストールする。
</p>
</div>
</div>
<div id="outline-container-org41e6fe4" class="outline-3">
<h3 id="org41e6fe4"><a href="#org41e6fe4"><span class="todo TODO">TODO</span> strategyを設定する</a></h3>
<div class="outline-text-3" id="text-org41e6fe4">
<p>
ubuntu22.04, ubuntu20.04, xubuntuを同時にテストできるようにしたい。できないにしても、動作確認には役立つ…か。少なくともデグレは防げる。
</p>
</div>
</div>
<div id="outline-container-org30ac417" class="outline-3">
<h3 id="org30ac417"><a href="#org30ac417"><span class="todo TODO">TODO</span> イメージを22.04に上げる</a></h3>
<div class="outline-text-3" id="text-org30ac417">
<p>
今は20.04。
</p>
</div>
</div>
<div id="outline-container-orge76a3df" class="outline-3">
<h3 id="orge76a3df"><a href="#orge76a3df"><span class="todo TODO">TODO</span> dist-upgradeする</a></h3>
<div class="outline-text-3" id="text-orge76a3df">
<p>
22.04をイメージのベースにするのが厳しそうなので、妥協してdist-upgradeを走らせる。
</p>

<p>
どうしてもアップデートの途中で止まってしまう。
</p>
</div>
</div>
<div id="outline-container-org18d4f31" class="outline-3">
<h3 id="org18d4f31"><a href="#org18d4f31"><span class="todo TODO">TODO</span> イメージ展開用のmakeタスクを作成</a></h3>
<div class="outline-text-3" id="text-org18d4f31">
<p>
動作検証で頻繁にやるので。
</p>
</div>
</div>
</div>
<div id="outline-container-orgd6974de" class="outline-2">
<h2 id="orgd6974de"><a href="#orgd6974de">Reference</a></h2>
<div class="outline-text-2" id="text-orgd6974de">
</div>
<div id="outline-container-org0f8dc95" class="outline-3">
<h3 id="org0f8dc95"><a href="#org0f8dc95"><a href="https://config.daviwil.com/desktop">Desktop Environment - config.daviwil.com</a></a></h3>
<div class="outline-text-3" id="text-org0f8dc95">
<p>
すごいdotfile。
</p>
</div>
</div>
<div id="outline-container-org1342e8a" class="outline-3">
<h3 id="org1342e8a"><a href="#org1342e8a"><a href="https://gitlab.com/dnsmichi/dotfiles">Michael Friedrich / dotfiles · GitLab</a></a></h3>
<div class="outline-text-3" id="text-org1342e8a">
<p>
dotfilesの例。
</p>
</div>
</div>
<div id="outline-container-orgf108bc1" class="outline-3">
<h3 id="orgf108bc1"><a href="#orgf108bc1"><a href="https://sachachua.com/dotemacs/">Sacha Chua&rsquo;s Emacs configuration</a>(Sacha Chua)</a></h3>
<div class="outline-text-3" id="text-orgf108bc1">
<p>
Emacsで有名な人のdotfiles。設定が莫大。
</p>
</div>
</div>
<div id="outline-container-orgf7cddac" class="outline-3">
<h3 id="orgf7cddac"><a href="#orgf7cddac"><a href="https://sqrtminusone.xyz/configs/readme/">My dotfiles</a>(SqrtMinusOne)</a></h3>
<div class="outline-text-3" id="text-orgf7cddac">
<p>
Emacs界隈でよく見かける人。グラフ化していて良い。
</p>
</div>
</div>
<div id="outline-container-org468a477" class="outline-3">
<h3 id="org468a477"><a href="#org468a477"><a href="https://mvallim.github.io/live-custom-ubuntu-from-scratch/">How to create a custom Ubuntu live from scratch | live-custom-ubuntu-from-scratch</a></a></h3>
<div class="outline-text-3" id="text-org468a477">
<p>
スクラッチでブータブルイメージを作る。
</p>
</div>
</div>
</div>
