20210912124846-dotfiles.org
** DONE dotfilesをCIテストする
CLOSED: [2021-10-03 Sun 14:07]
:LOGBOOK:
CLOCK: [2021-10-03 Sun 12:44]--[2021-10-03 Sun 14:06] =>  1:22
CLOCK: [2021-10-03 Sun 11:13]--[2021-10-03 Sun 12:02] =>  0:49
:END:
<2021-10-03 Sun>
- [[https://uu64.me/blog/2020/11/dotfiles][Github Actions を使って dotfiles の CI を Ubuntu/macOS 上で実行する | uu64.me]]

テスト、Lintはセットしたが、実行時エラーが解消できない。guixに依存した ~.bash_profile~ なんだよな。
** DONE [[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]でテストする
CLOSED: [2022-02-20 Sun 00:28]
:LOGBOOK:
CLOCK: [2022-02-19 Sat 11:29]--[2022-02-19 Sat 11:54] =>  0:25
CLOCK: [2022-02-19 Sat 11:02]--[2022-02-19 Sat 11:27] =>  0:25
CLOCK: [2022-02-19 Sat 10:36]--[2022-02-19 Sat 11:01] =>  0:25
CLOCK: [2022-02-19 Sat 10:10]--[2022-02-19 Sat 10:35] =>  0:25
:END:
クリーンな環境で一連のインストール作業ができるかチェックすると安心だろう。
[[id:d694ecaa-6a8b-4669-a95c-f76de6dcbd2c][GNU Guix]]関連をどうするかで詰まっている。使いこなせれば[[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]でやる必要はなくなるはずだが。
docker ubuntuではsystemctlが起動できないようになっているなので、[[id:d694ecaa-6a8b-4669-a95c-f76de6dcbd2c][GNU Guix]]が起動せず、依存関係が満たせない。
GitHub Actionでは実行できるのでそれでやった。実行テストさえできればいいだろう。
** DONE dotfilesにSSH設定の例を追加する
CLOSED: [2022-01-09 Sun 10:14] DEADLINE: <2022-01-08 Sat 23:50>

少なくとも例だけのせておくと便利だろう。
環境を楽に選択できるようconfigを設定する。
https://qiita.com/hkak03key/items/3b0c4752bfbcc52e676d
** DONE インストールディスクを作成する(いちいち最初からするのが面倒なので)
CLOSED: [2022-09-14 Wed 14:15]
:LOGBOOK:
CLOCK: [2022-09-14 Wed 11:20]--[2022-09-14 Wed 11:45] =>  0:25
CLOCK: [2022-09-14 Wed 10:45]--[2022-09-14 Wed 11:10] =>  0:25
CLOCK: [2022-09-14 Wed 09:13]--[2022-09-14 Wed 09:38] =>  0:25
CLOCK: [2022-09-14 Wed 08:35]--[2022-09-14 Wed 09:00] =>  0:25
CLOCK: [2022-09-14 Wed 07:07]--[2022-09-14 Wed 07:32] =>  0:25
CLOCK: [2022-09-13 Tue 17:51]--[2022-09-13 Tue 18:16] =>  0:25
CLOCK: [2022-09-13 Tue 17:25]--[2022-09-13 Tue 17:50] =>  0:25
CLOCK: [2022-09-13 Tue 16:32]--[2022-09-13 Tue 16:57] =>  0:25
CLOCK: [2022-09-13 Tue 14:50]--[2022-09-13 Tue 15:15] =>  0:25
CLOCK: [2022-09-13 Tue 14:15]--[2022-09-13 Tue 14:40] =>  0:25
CLOCK: [2022-09-13 Tue 13:41]--[2022-09-13 Tue 14:06] =>  0:25
CLOCK: [2022-09-13 Tue 12:53]--[2022-09-13 Tue 13:18] =>  0:25
CLOCK: [2022-09-13 Tue 12:27]--[2022-09-13 Tue 12:52] =>  0:25
CLOCK: [2022-09-13 Tue 07:42]--[2022-09-13 Tue 08:07] =>  0:25
CLOCK: [2022-09-13 Tue 07:14]--[2022-09-13 Tue 07:39] =>  0:25
CLOCK: [2022-09-12 Mon 20:01]--[2022-09-12 Mon 20:26] =>  0:25
CLOCK: [2022-09-12 Mon 19:31]--[2022-09-12 Mon 19:57] =>  0:26
CLOCK: [2022-09-12 Mon 18:45]--[2022-09-12 Mon 19:10] =>  0:25
CLOCK: [2022-09-12 Mon 18:19]--[2022-09-12 Mon 18:44] =>  0:25
CLOCK: [2022-09-12 Mon 15:17]--[2022-09-12 Mon 15:42] =>  0:25
CLOCK: [2022-09-12 Mon 14:10]--[2022-09-12 Mon 14:35] =>  0:25
CLOCK: [2022-09-12 Mon 13:45]--[2022-09-12 Mon 14:10] =>  0:25
CLOCK: [2022-09-12 Mon 13:20]--[2022-09-12 Mon 13:45] =>  0:25
CLOCK: [2022-09-12 Mon 11:40]--[2022-09-12 Mon 12:05] =>  0:25
CLOCK: [2022-09-12 Mon 11:06]--[2022-09-12 Mon 11:31] =>  0:25
CLOCK: [2022-09-12 Mon 10:41]--[2022-09-12 Mon 11:06] =>  0:25
CLOCK: [2022-09-12 Mon 09:51]--[2022-09-12 Mon 10:16] =>  0:25
CLOCK: [2022-09-12 Mon 09:12]--[2022-09-12 Mon 09:37] =>  0:25
CLOCK: [2022-09-12 Mon 08:47]--[2022-09-12 Mon 09:12] =>  0:25
CLOCK: [2022-09-12 Mon 08:22]--[2022-09-12 Mon 08:47] =>  0:25
CLOCK: [2022-09-12 Mon 07:57]--[2022-09-12 Mon 08:22] =>  0:25
CLOCK: [2022-09-11 Sun 09:37]--[2022-09-11 Sun 10:02] =>  0:25
:END:
すべて整備された状態でクリーンインストールできるようにしたい。イメージを作るとかそういうのができるはず。system.scmではパーティションやユーザ名を入力するのだから。

- [[https://github.com/daviwil/dotfiles/blob/master/Systems.org#system-installation][system-installation]]
- [[https://qiita.com/misohagi/items/4443fcc495366c717c38][GitHub ActionsでカスタマイズしたUbuntuのISOイメージを作る - Qiita]]
- [[https://rohhie.net/ubuntu20-04-try-to-make-a-live-cd-from-scratch-basic/][Ubuntu20.04 Live CDを作ってみる 基本編 | ろっひー]]

可能なことは確かだが、全然わからない。
** CLOSE mozcのdotfilesを用意する
CLOSED: [2022-04-10 Sun 20:28]
:LOGBOOK:
CLOCK: [2022-04-10 Sun 20:11]--[2022-04-10 Sun 20:28] =>  0:17
:END:
configファイルはないようだ。なのでファイル管理できない。

** DONE 色を変えて再起動するpolybar設定
CLOSED: [2022-09-14 Wed 14:18]
:LOGBOOK:
CLOCK: [2022-06-04 Sat 11:42]--[2022-06-04 Sat 12:07] =>  0:25
CLOCK: [2022-06-04 Sat 11:11]--[2022-06-04 Sat 11:36] =>  0:25
CLOCK: [2022-06-04 Sat 10:58]--[2022-06-04 Sat 11:11] =>  0:13
:END:
** DONE polybarとpomodoroを連携させる
CLOSED: [2022-01-16 Sun 17:13]
:LOGBOOK:
CLOCK: [2022-01-16 Sun 22:41]--[2022-01-16 Sun 23:06] =>  0:25
CLOCK: [2022-01-16 Sun 20:39]--[2022-01-16 Sun 21:04] =>  0:25
CLOCK: [2022-01-16 Sun 20:01]--[2022-01-16 Sun 20:26] =>  0:25
CLOCK: [2022-01-16 Sun 16:33]--[2022-01-16 Sun 16:58] =>  0:25
CLOCK: [2022-01-16 Sun 16:02]--[2022-01-16 Sun 16:27] =>  0:25
:END:
- [[https://colekillian.com/posts/org-pomodoro-and-polybar/][Org Pomodoro and Polybar - Cole Killian Adventure]]

改良してゲージ型にした。
全体カウント機能を追加した。一日ごとにリセットする。
** DONE [[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]で動作チェックできるようにする
CLOSED: [2022-09-14 Wed 14:19]
クリーンな環境でうまくいっているかチェックしたい。
Guix関連が難しく、詰まっている。
** DONE xfce4にする
CLOSED: [2022-09-15 Thu 10:26]
:LOGBOOK:
CLOCK: [2022-09-15 Thu 09:39]--[2022-09-15 Thu 10:04] =>  0:25
CLOCK: [2022-09-15 Thu 07:31]--[2022-09-15 Thu 07:56] =>  0:25
CLOCK: [2022-09-15 Thu 01:20]--[2022-09-15 Thu 01:45] =>  0:25
CLOCK: [2022-09-15 Thu 00:34]--[2022-09-15 Thu 00:59] =>  0:25
:END:

[[id:eb196529-bdbd-48c5-9d5b-a156fe5c2f41][EXWM]]の関係で、xfceのほうがいい。
** CLOSE emacsをCIで初回起動する
CLOSED: [2022-09-17 Sat 17:04]
:LOGBOOK:
CLOCK: [2022-09-17 Sat 16:39]--[2022-09-17 Sat 17:04] =>  0:25
CLOCK: [2022-09-17 Sat 14:20]--[2022-09-17 Sat 14:45] =>  0:25
CLOCK: [2022-09-17 Sat 13:32]--[2022-09-17 Sat 13:57] =>  0:25
CLOCK: [2022-09-17 Sat 13:22]--[2022-09-17 Sat 13:32] =>  0:10
CLOCK: [2022-09-17 Sat 12:56]--[2022-09-17 Sat 13:21] =>  0:25
CLOCK: [2022-09-17 Sat 12:15]--[2022-09-17 Sat 12:40] =>  0:25
CLOCK: [2022-09-17 Sat 08:22]--[2022-09-17 Sat 08:47] =>  0:25
CLOCK: [2022-09-16 Fri 16:39]--[2022-09-16 Fri 17:04] =>  0:25
CLOCK: [2022-09-16 Fri 16:10]--[2022-09-16 Fri 16:35] =>  0:25
CLOCK: [2022-09-16 Fri 15:41]--[2022-09-16 Fri 16:06] =>  0:25
CLOCK: [2022-09-16 Fri 14:59]--[2022-09-16 Fri 15:24] =>  0:25
CLOCK: [2022-09-16 Fri 10:38]--[2022-09-16 Fri 11:03] =>  0:25
CLOCK: [2022-09-16 Fri 09:47]--[2022-09-16 Fri 10:12] =>  0:25
CLOCK: [2022-09-16 Fri 09:21]--[2022-09-16 Fri 09:46] =>  0:25
CLOCK: [2022-09-16 Fri 08:54]--[2022-09-16 Fri 09:19] =>  0:25
CLOCK: [2022-09-16 Fri 08:11]--[2022-09-16 Fri 08:36] =>  0:25
CLOCK: [2022-09-16 Fri 07:42]--[2022-09-16 Fri 08:07] =>  0:25
CLOCK: [2022-09-15 Thu 20:33]--[2022-09-15 Thu 20:58] =>  0:25
CLOCK: [2022-09-15 Thu 18:22]--[2022-09-15 Thu 18:47] =>  0:25
CLOCK: [2022-09-15 Thu 13:33]--[2022-09-15 Thu 13:58] =>  0:25
CLOCK: [2022-09-15 Thu 11:19]--[2022-09-15 Thu 11:44] =>  0:25
CLOCK: [2022-09-15 Thu 10:41]--[2022-09-15 Thu 11:06] =>  0:25
:END:
いろいろ走るので初回が遅い。.emacs.dを指定して起動、とかしたらいいかな。emacs-sqliteのバイナリが見つからないエラーになる。ライブラリが入ってないため、コンパイルが自動でされないよう。

- emacsql-sqlite

cコンパイラ(gcc, clang, build-essentialどれでも )をインストールするとemacs-sqliteのコンパイルはできるようになる。だがubuntu自体の起動が失敗する。謎。Ubuntuインストール後、Guixでgccインストール、手動でコンパイルするしかない。めんどくさい。

- vterm

いくつかライブラリが必要。ない場合は自動コンパイルが走りわかりやすいエラー文も出るので対処はしやすい。

emacsを起動したイメージでブートすると、ユーザ作成モーダルを抜けられない。何らかの権限的な理由でユーザ作成に失敗しているように見える。
** DONE caskはタグが打たれたときだけ実行する
CLOSED: [2022-09-17 Sat 17:04]
実行時間が長いので、開発に支障が出る。
** DONE URLとファイル名を定数化する
CLOSED: [2022-09-17 Sat 17:33]
** DONE cloner追加
CLOSED: [2022-09-17 Sat 21:35]
:LOGBOOK:
CLOCK: [2022-09-15 Thu 16:15]--[2022-09-15 Thu 16:40] =>  0:25
CLOCK: [2022-09-15 Thu 14:03]--[2022-09-15 Thu 14:28] =>  0:25
:END:
cargo install clonerを追加する。

- build-essential が入ってないので、ビルドに失敗する
- build-essential を入れるとubiquityが失敗する
** CLOSE バージョン情報、gitハッシュ情報をイメージに含める
CLOSED: [2022-09-18 Sun 12:00]
:LOGBOOK:
CLOCK: [2022-09-18 Sun 11:40]--[2022-09-18 Sun 12:00] =>  0:20
CLOCK: [2022-09-17 Sat 17:30]--[2022-09-17 Sat 17:55] =>  0:25
:END:
あとから、イメージがどのバージョンなのかわからないので。それ用のファイルはありそうだが。

まあ、USBのパーティションの名前に含めればいいか。
** DONE qemuを入れる
CLOSED: [2022-09-18 Sun 17:50]
使うので。
** DONE dockerイメージを作る
CLOSED: [2022-09-18 Sun 17:50]
:LOGBOOK:
CLOCK: [2022-09-18 Sun 16:27]--[2022-09-18 Sun 16:52] =>  0:25
CLOCK: [2022-09-18 Sun 15:30]--[2022-09-18 Sun 15:55] =>  0:25
CLOCK: [2022-09-18 Sun 14:32]--[2022-09-18 Sun 14:57] =>  0:25
CLOCK: [2022-09-18 Sun 14:04]--[2022-09-18 Sun 14:29] =>  0:25
CLOCK: [2022-09-18 Sun 12:32]--[2022-09-18 Sun 12:57] =>  0:25
CLOCK: [2022-09-18 Sun 12:07]--[2022-09-18 Sun 12:32] =>  0:25
:END:
動作検証できるように、isoからイメージにしておく。

- [[https://medium.com/@SofianeHamlaoui/convert-iso-images-to-docker-images-4e1b1b637d75][🐳 Convert ISO images to docker images | by Sofiane Hamlaoui | Medium]]

単にtarに固めただけでできた。デバッグやテストもやりやすそうだ。
