20210912124846-dotfiles.html
<div id="outline-container-org330bec8" class="outline-2">
<h2 id="org330bec8"><a href="#org330bec8">Archives</a></h2>
<div class="outline-text-2" id="text-org330bec8">
</div>
<div id="outline-container-org89c77bc" class="outline-3">
<h3 id="org89c77bc"><a href="#org89c77bc"><span class="done DONE">DONE</span> dotfilesをCIテストする</a></h3>
<div class="outline-text-3" id="text-org89c77bc">
<p>

</p>
<ul class="org-ul">
<li><a href="https://uu64.me/blog/2020/11/dotfiles">Github Actions を使って dotfiles の CI を Ubuntu/macOS 上で実行する | uu64.me</a></li>
</ul>

<p>
テスト、Lintはセットしたが、実行時エラーが解消できない。guixに依存した <code>.bash_profile</code> なんだよな。
</p>
</div>
</div>
<div id="outline-container-org1f0f451" class="outline-3">
<h3 id="org1f0f451"><a href="#org1f0f451"><span class="done DONE">DONE</span> <a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>でテストする</a></h3>
<div class="outline-text-3" id="text-org1f0f451">
<p>
クリーンな環境で一連のインストール作業ができるかチェックすると安心だろう。
<a href="20210525005710-gnu_guix.html#ID-d694ecaa-6a8b-4669-a95c-f76de6dcbd2c">GNU Guix</a>関連をどうするかで詰まっている。使いこなせれば<a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>でやる必要はなくなるはずだが。
docker ubuntuではsystemctlが起動できないようになっているなので、<a href="20210525005710-gnu_guix.html#ID-d694ecaa-6a8b-4669-a95c-f76de6dcbd2c">GNU Guix</a>が起動せず、依存関係が満たせない。
GitHub Actionでは実行できるのでそれでやった。実行テストさえできればいいだろう。
</p>
</div>
</div>
<div id="outline-container-orgc7f8763" class="outline-3">
<h3 id="orgc7f8763"><a href="#orgc7f8763"><span class="done DONE">DONE</span> dotfilesにSSH設定の例を追加する</a></h3>
<div class="outline-text-3" id="text-orgc7f8763">
<p>
少なくとも例だけのせておくと便利だろう。
環境を楽に選択できるようconfigを設定する。
<a href="https://qiita.com/hkak03key/items/3b0c4752bfbcc52e676d">https://qiita.com/hkak03key/items/3b0c4752bfbcc52e676d</a>
</p>
</div>
</div>
<div id="outline-container-org43d008f" class="outline-3">
<h3 id="org43d008f"><a href="#org43d008f"><span class="done DONE">DONE</span> インストールディスクを作成する(いちいち最初からするのが面倒なので)</a></h3>
<div class="outline-text-3" id="text-org43d008f">
<p>
すべて整備された状態でクリーンインストールできるようにしたい。イメージを作るとかそういうのができるはず。system.scmではパーティションやユーザ名を入力するのだから。
</p>

<ul class="org-ul">
<li><a href="https://github.com/daviwil/dotfiles/blob/master/Systems.org#system-installation">system-installation</a></li>
<li><a href="https://qiita.com/misohagi/items/4443fcc495366c717c38">GitHub ActionsでカスタマイズしたUbuntuのISOイメージを作る - Qiita</a></li>
<li><a href="https://rohhie.net/ubuntu20-04-try-to-make-a-live-cd-from-scratch-basic/">Ubuntu20.04 Live CDを作ってみる 基本編 | ろっひー</a></li>
</ul>

<p>
可能なことは確かだが、全然わからない。
</p>
</div>
</div>
<div id="outline-container-org5b2bbcc" class="outline-3">
<h3 id="org5b2bbcc"><a href="#org5b2bbcc"><span class="done CLOSE">CLOSE</span> mozcのdotfilesを用意する</a></h3>
<div class="outline-text-3" id="text-org5b2bbcc">
<p>
configファイルはないようだ。なのでファイル管理できない。
</p>
</div>
</div>

<div id="outline-container-org3fb96ff" class="outline-3">
<h3 id="org3fb96ff"><a href="#org3fb96ff"><span class="done DONE">DONE</span> 色を変えて再起動するpolybar設定</a></h3>
<div class="outline-text-3" id="text-org3fb96ff">
</div>
</div>
<div id="outline-container-orgcfc858e" class="outline-3">
<h3 id="orgcfc858e"><a href="#orgcfc858e"><span class="done DONE">DONE</span> polybarとpomodoroを連携させる</a></h3>
<div class="outline-text-3" id="text-orgcfc858e">
<ul class="org-ul">
<li><a href="https://colekillian.com/posts/org-pomodoro-and-polybar/">Org Pomodoro and Polybar - Cole Killian Adventure</a></li>
</ul>

<p>
改良してゲージ型にした。
全体カウント機能を追加した。一日ごとにリセットする。
</p>
</div>
</div>
<div id="outline-container-orgba04722" class="outline-3">
<h3 id="orgba04722"><a href="#orgba04722"><span class="done DONE">DONE</span> <a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>で動作チェックできるようにする</a></h3>
<div class="outline-text-3" id="text-orgba04722">
<p>
クリーンな環境でうまくいっているかチェックしたい。
Guix関連が難しく、詰まっている。
</p>
</div>
</div>
<div id="outline-container-orgbd337b7" class="outline-3">
<h3 id="orgbd337b7"><a href="#orgbd337b7"><span class="done DONE">DONE</span> xfce4にする</a></h3>
<div class="outline-text-3" id="text-orgbd337b7">
<p>
<a href="20210905140122-exwm.html#ID-eb196529-bdbd-48c5-9d5b-a156fe5c2f41">EXWM</a>の関係で、xfceのほうがいい。
</p>
</div>
</div>
<div id="outline-container-orgfe077d3" class="outline-3">
<h3 id="orgfe077d3"><a href="#orgfe077d3"><span class="done CLOSE">CLOSE</span> emacsをCIで初回起動する</a></h3>
<div class="outline-text-3" id="text-orgfe077d3">
<p>
いろいろ走るので初回が遅い。.emacs.dを指定して起動、とかしたらいいかな。emacs-sqliteのバイナリが見つからないエラーになる。ライブラリが入ってないため、コンパイルが自動でされないよう。
</p>

<ul class="org-ul">
<li>emacsql-sqlite</li>
</ul>

<p>
cコンパイラ(gcc, clang, build-essentialどれでも )をインストールするとemacs-sqliteのコンパイルはできるようになる。だがubuntu自体の起動が失敗する。謎。Ubuntuインストール後、Guixでgccインストール、手動でコンパイルするしかない。めんどくさい。
</p>

<ul class="org-ul">
<li>vterm</li>
</ul>

<p>
いくつかライブラリが必要。ない場合は自動コンパイルが走りわかりやすいエラー文も出るので対処はしやすい。
</p>

<p>
emacsを起動したイメージでブートすると、ユーザ作成モーダルを抜けられない。何らかの権限的な理由でユーザ作成に失敗しているように見える。
</p>
</div>
</div>
<div id="outline-container-orgb217b97" class="outline-3">
<h3 id="orgb217b97"><a href="#orgb217b97"><span class="done DONE">DONE</span> caskはタグが打たれたときだけ実行する</a></h3>
<div class="outline-text-3" id="text-orgb217b97">
<p>
実行時間が長いので、開発に支障が出る。
</p>
</div>
</div>
<div id="outline-container-org5086429" class="outline-3">
<h3 id="org5086429"><a href="#org5086429"><span class="done DONE">DONE</span> URLとファイル名を定数化する</a></h3>
<div class="outline-text-3" id="text-org5086429">
</div>
</div>
<div id="outline-container-org0fd4770" class="outline-3">
<h3 id="org0fd4770"><a href="#org0fd4770"><span class="done DONE">DONE</span> cloner追加</a></h3>
<div class="outline-text-3" id="text-org0fd4770">
<p>
cargo install clonerを追加する。
</p>

<ul class="org-ul">
<li>build-essential が入ってないので、ビルドに失敗する</li>
<li>build-essential を入れるとubiquityが失敗する</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe8ec47" class="outline-3">
<h3 id="orgbe8ec47"><a href="#orgbe8ec47"><span class="done CLOSE">CLOSE</span> バージョン情報、gitハッシュ情報をイメージに含める</a></h3>
<div class="outline-text-3" id="text-orgbe8ec47">
<p>
あとから、イメージがどのバージョンなのかわからないので。それ用のファイルはありそうだが。
</p>

<p>
まあ、USBのパーティションの名前に含めればいいか。
</p>
</div>
</div>
<div id="outline-container-org700ad9c" class="outline-3">
<h3 id="org700ad9c"><a href="#org700ad9c"><span class="done DONE">DONE</span> qemuを入れる</a></h3>
<div class="outline-text-3" id="text-org700ad9c">
<p>
使うので。
</p>
</div>
</div>
<div id="outline-container-org6937f2a" class="outline-3">
<h3 id="org6937f2a"><a href="#org6937f2a"><span class="done DONE">DONE</span> dockerイメージを作る</a></h3>
<div class="outline-text-3" id="text-org6937f2a">
<p>
動作検証できるように、isoからイメージにしておく。
</p>

<ul class="org-ul">
<li><a href="https://medium.com/@SofianeHamlaoui/convert-iso-images-to-docker-images-4e1b1b637d75">🐳 Convert ISO images to docker images | by Sofiane Hamlaoui | Medium</a></li>
</ul>

<p>
単にtarに固めただけでできた。デバッグやテストもやりやすそうだ。
</p>
</div>
</div>
