20210912124846-dotfiles.org
** DONE 必須のgoライブラリを入れる
CLOSED: [2022-09-18 Sun 17:55]
:LOGBOOK:
CLOCK: [2022-09-18 Sun 13:03]--[2022-09-18 Sun 13:28] =>  0:25
:END:
LSP, DAPを入れる。

ダウンロードすると、起動しなくなる。emacsを起動と同じく、何か特定のことをすると動かなくなる。走らせるとシステムディレクトリに何らかの変更をもたらす場合、動かなくなる可能性。たとえば ~go install~ やemacs起動したとき、ホームディレクトリ以外に何かを保存するとか。

とりあえずisoビルド段階では入れず、makeタスクに追加した。
